say .QueueExecutionStatus~name(.QueueExecutionStatus~OK)
say .QueueExecutionPhase~name(.QueueExecutionPhase~PREPARED)
exit 0
::requires "QueueRexxExecution.cls"
