say .ReputationEffectBuild~PRODUCT .ReputationEffectBuild~VERSION
geo = .ReputationGeography~new('GB','COUNTRY','','United Kingdom')
say geo~geographyId
exit 0
::requires 'ReputationEffect.cls'
