* MASCB - public application parameter block layouts, ABI level 1
MASABIV  EQU   1
*
MASPHDR  DSECT
MASPEYE  DS    CL4
MASPLEN  DS    H
MASPVER  DS    H
MASPRC   DS    F
MASPRSN  DS    F
MASPFLG  DS    F
MASPHSZ  EQU   *-MASPHDR
*
MASCNP   DSECT
MASCNEYE DS    CL4             'MSCN'
MASCNLEN DS    H
MASCNVER DS    H
MASCNRC  DS    F
MASCNRSN DS    F
MASCNFLG DS    F
MASCNSES DS    F               RETURNED LOCAL SESSION TOKEN
MASCNNLP DS    A               SERVICE NAME ADDRESS (LOCAL ONLY)
MASCNNLL DS    H               SERVICE NAME LENGTH
MASCNRSV DS    H               MUST BE ZERO
MASCNSZ  EQU   *-MASCNP
