use strict arg handles
parse var handles h1 h2
p1=.AlchemyDotNetObject~new(h1)
p2=.AlchemyDotNetObject~new(h2)
return p1~echo(p2)
::requires 'AlchemyDotNetObject.cls'
