say .SemanticSourceMethodService
say .SemanticSourceResourceService
say .SemanticSourcePackageService
say "DEV6 SERVICES COMPILE: PASS"
exit 0
::requires "../src/SemanticSourceMethodService.cls"
::requires "../src/SemanticSourceResourceService.cls"
::requires "../src/SemanticSourcePackageService.cls"
