say "DEV12 SERVICES COMPILE: PASS"
exit 0
::requires '../src/SemanticSourceStore.cls'
::requires '../src/SemanticSourceLanguageService.cls'
::requires '../src/SemanticSourceSourceUnitService.cls'
::requires '../src/SemanticSourceRexxIntrospector.cls'
::requires '../src/SemanticSourceGraphService.cls'
::requires '../src/SemanticSourceModuleService.cls'
::requires '../src/SemanticSourceBranchService.cls'
::requires '../src/SemanticSourcePackageService.cls'
::requires '../src/SemanticSourceCodeExaminer.cls'
