say .ReputationFeedBuild~PRODUCT .ReputationFeedBuild~VERSION
p = .ReputationLineagePolicy~new
say p~articleSimilarityThreshold
exit 0
::requires 'ReputationFeed.cls'
